{
  "_name_or_path": "bert-base-cased",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Psoriasis",
    "1": "Varicose Veins",
    "2": "Typhoid",
    "3": "Chicken pox",
    "4": "Impetigo",
    "5": "Dengue",
    "6": "Fungal infection",
    "7": "Common Cold",
    "8": "Pneumonia",
    "9": "Dimorphic Hemorrhoids",
    "10": "Arthritis",
    "11": "Acne",
    "12": "Bronchial Asthma",
    "13": "Hypertension",
    "14": "Migraine",
    "15": "Cervical spondylosis",
    "16": "Jaundice",
    "17": "Malaria",
    "18": "urinary tract infection",
    "19": "allergy",
    "20": "gastroesophageal reflux disease",
    "21": "drug reaction",
    "22": "peptic ulcer disease",
    "23": "diabetes",
    "24": "Cold Sores",
    "25": "Constipation",
    "26": "Dental Abscess",
    "27": "Diarrhea",
    "28": "Hemorrhoids",
    "29": "Insomnia",
    "30": "Muscle Spasm",
    "31": "Nausea/Vomiting",
    "32": "Unknown"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Acne": 11,
    "Arthritis": 10,
    "Bronchial Asthma": 12,
    "Cervical spondylosis": 15,
    "Chicken pox": 3,
    "Cold Sores": 24,
    "Common Cold": 7,
    "Constipation": 25,
    "Dengue": 5,
    "Dental Abscess": 26,
    "Diarrhea": 27,
    "Dimorphic Hemorrhoids": 9,
    "Fungal infection": 6,
    "Hemorrhoids": 28,
    "Hypertension": 13,
    "Impetigo": 4,
    "Insomnia": 29,
    "Jaundice": 16,
    "Malaria": 17,
    "Migraine": 14,
    "Muscle Spasm": 30,
    "Nausea/Vomiting": 31,
    "Pneumonia": 8,
    "Psoriasis": 0,
    "Typhoid": 2,
    "Unknown": 32,
    "Varicose Veins": 1,
    "allergy": 19,
    "diabetes": 23,
    "drug reaction": 21,
    "gastroesophageal reflux disease": 20,
    "peptic ulcer disease": 22,
    "urinary tract infection": 18
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_attentions": true,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "transformers_version": "4.33.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 28996
}
